dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioRxHandler.c
/*
 * Copyright (c) 2023 dresden elektronik ingenieurtechnik gmbh.
 * All rights reserved.
 *
 * The software in this package is published under the terms of the BSD
 * style license a copy of which has been included with this distribution in
 * the LICENSE.txt file.
 *
 */
#include "samr21RadioRxHandler.h"

static RxBuffer s_rxBuffer[NUM_SAMR21_RX_BUFFER];
static uint8_t s_activeRxBuffer = 0;

volatile bool s_rxSlottedActive = false;
uint32_t s_recivedFramesWhileSlotActive;
uint32_t s_slottedListeningDuration_us;
uint8_t s_slottedListeningChannel;

volatile bool s_rxAbort = false;
volatile bool s_rxHandlerActive = false;

static struct 
{
    otRadioFrame otAck;
    uint8_t psdu[IEEE_802_15_4_FRAME_SIZE];
    uint8_t numBytesUploaded;
}s_currentAckTransmission;



static struct 
{
    bool        securityHeaderPresent;
    bool        needsEncryption;

    uint8_t*    header;
    uint8_t     headerLen;

    uint8_t*    payload;
    uint8_t     payloadLen;

    uint8_t*    mic;
    uint8_t     micSize;

    uint8_t*     pendingAesResultBuffer;

    uint8_t nonce[AES_BLOCK_SIZE];
    uint8_t encryptionBlocks[(IEEE_802_15_4_FRAME_SIZE / AES_BLOCK_SIZE)][AES_BLOCK_SIZE];

    struct
    {
        uint8_t numEncryptionBlocks;
        uint8_t numProcessedEncryptionBlocks;
    } ctr;
    
    uint8_t cbcBlock[AES_BLOCK_SIZE];

    struct
    {
        uint8_t currentBlockLen;
        uint8_t numProcessedHeaderBytes;
        uint8_t numProcessedPayloadBytes;
    } cbc;
    
}s_currentAckTransmissionSecurity;

static void samr21RadioRxCleanup(bool success){
    samr21Timer4Stop();

    PORT->Group[0].OUTCLR.reg= PORT_PA08;

    __disable_irq();
    RxBuffer *bufferDone = &s_rxBuffer[s_activeRxBuffer];
  
    if (success)
    {


        bufferDone->status = RX_STATUS_DONE;
        s_activeRxBuffer = ( s_activeRxBuffer + 1 ) % NUM_SAMR21_RX_BUFFER;
        if (s_rxSlottedActive){
            s_recivedFramesWhileSlotActive++;
        }
    }

exit:
    samr21RadioRxResetBuffer(&s_rxBuffer[s_activeRxBuffer]);
    __enable_irq();

    if(success){
        cb_samr21RadioRxDone(bufferDone);
    }
}

static void samr21RadioRxSendImmAck()
{
    // Timout-Timer
    samr21Timer4Set((IEEE_802_15_4_FRAME_SIZE * 2) * IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us);

    RxBuffer *buffer = &s_rxBuffer[s_activeRxBuffer];
    buffer->status = RX_STATUS_SENDING_ACK;

    otMacFrameGenerateImmAck(
        &(buffer->otFrame),
        buffer->framePending,
        &s_currentAckTransmission.otAck);
    s_currentAckTransmission.psdu[0] = s_currentAckTransmission.otAck.mLength;

    while (g_trxStatus.bit.trxStatus != TRX_STATUS_PLL_ON)
    {
        samr21TrxUpdateStatus();
    }

    // Start Trasmission in advance, there is some spare time while the Preamble and SFD is transmitted
    samr21TrxSetSLP_TR(true);
    PORT->Group[0].OUTSET.reg= PORT_PA08;

    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_WRITE, NULL);
    samr21TrxSetSLP_TR(false);
    samr21TrxSpiTransceiveBytesRaw(&s_currentAckTransmission.otAck.mPsdu[-1], NULL, s_currentAckTransmission.otAck.mLength - 1); // -2 FCS +1 PhyLen
    samr21TrxSpiCloseAccess();

    buffer->otFrame.mInfo.mRxInfo.mAckedWithFramePending = buffer->framePending;
    buffer->otFrame.mInfo.mRxInfo.mAckedWithSecEnhAck = false;
    buffer->otFrame.mInfo.mRxInfo.mAckFrameCounter = 0;
    buffer->otFrame.mInfo.mRxInfo.mAckKeyId = 0;

    buffer->status = RX_STATUS_SENDING_ACK_WAIT_TRX_END;
    samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);
}

static void samr21RadioRxAckUploadAllRaw(){
        samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_WRITE, NULL);
        samr21TrxSpiTransceiveBytesRaw(&s_currentAckTransmission.psdu[0], NULL, s_currentAckTransmission.psdu[0] - 1); // -2 FCS +1 PhyLen
        samr21TrxSpiCloseAccess();

        s_currentAckTransmission.numBytesUploaded = s_currentAckTransmission.psdu[-1];

        //Queue Move to RX in advance, this will only executes after TX is done
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);

        s_rxBuffer[s_activeRxBuffer].status = RX_STATUS_SENDING_ACK_WAIT_TRX_END;
        samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);
}

static void samr21RadioRxAckUploadHeader(){

    //Write via SRAM starting from Addr 0x00 of Framebuffer (->phyLen)
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, 0x00);
    samr21TrxSpiTransceiveBytesRaw(&s_currentAckTransmission.psdu[0], NULL, s_currentAckTransmissionSecurity.headerLen + 1); // phyLen not in psduLen
    samr21TrxSpiCloseAccess();

    s_currentAckTransmission.numBytesUploaded = s_currentAckTransmissionSecurity.headerLen;
    s_rxBuffer[s_activeRxBuffer].status = RX_STATUS_SENDING_ENH_ACK_UPLOADED_HEADER;
}

static void samr21RadioRxAckUploadPayload(){
    s_currentAckTransmissionSecurity.ctr.numEncryptionBlocks = s_currentAckTransmissionSecurity.payloadLen / AES_BLOCK_SIZE ;
    s_currentAckTransmissionSecurity.ctr.numEncryptionBlocks += (s_currentAckTransmissionSecurity.payloadLen % AES_BLOCK_SIZE ? 1 : 0);

    while (s_currentAckTransmissionSecurity.ctr.numEncryptionBlocks > s_currentAckTransmissionSecurity.ctr.numProcessedEncryptionBlocks)
    {
        //Save some Time if no encryption is needed
        if(s_currentAckTransmissionSecurity.needsEncryption){
            // increase Nonce Counter
            s_currentAckTransmissionSecurity.nonce[(AES_BLOCK_SIZE - 1)]++;
            // start uploading next AES Block, while reading the result of the last Block
            samr21RadioAesEcbEncrypt(s_currentAckTransmissionSecurity.nonce, s_currentAckTransmissionSecurity.pendingAesResultBuffer);
            
            s_currentAckTransmissionSecurity.pendingAesResultBuffer = 
                s_currentAckTransmissionSecurity.encryptionBlocks[
                    s_currentAckTransmissionSecurity.nonce[(AES_BLOCK_SIZE - 1)]
                ]
            ;
        } 
        s_currentAckTransmissionSecurity.ctr.numProcessedEncryptionBlocks++;

