dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioRxHandler.c
        // While AES is busy, an encrypted payload-block can be uploaded 
        // This gives headroom for longer AES Operation, while simultaniusly topping of the FrameBuffer

        //Write via SRAM starting from Addr of the current Byte to the Framebuffer
        samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, (uint8_t)(s_currentAckTransmission.numBytesUploaded + 1)); // phyLen not in psduLen

        for (uint8_t i = 0; i < AES_BLOCK_SIZE; i++)
        {
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
            samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
            // Upload (encrypted) payload to Framebuffer
            if (s_currentAckTransmissionSecurity.needsEncryption)
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_currentAckTransmission.otAck.mPsdu[s_currentAckTransmission.numBytesUploaded++] 
                    ^ s_currentAckTransmissionSecurity.encryptionBlocks[s_currentAckTransmissionSecurity.ctr.numProcessedEncryptionBlocks][i]);
            }
            else
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_currentAckTransmission.otAck.mPsdu[s_currentAckTransmission.numBytesUploaded++]);
            }
        }

        samr21TrxSpiCloseAccess();
    }
    if(s_currentAckTransmissionSecurity.needsEncryption){
        // get Last Payload encryptionBlock and start MIC encryptionBlock
        s_currentAckTransmissionSecurity.nonce[(AES_BLOCK_SIZE - 1)] = 0; ////The Nonce for MIC encryption has the CTR value 0
        samr21RadioAesEcbEncrypt(s_currentAckTransmissionSecurity.nonce, s_currentAckTransmissionSecurity.pendingAesResultBuffer);
        s_currentAckTransmissionSecurity.pendingAesResultBuffer = 
            s_currentAckTransmissionSecurity.encryptionBlocks[
                s_currentAckTransmissionSecurity.nonce[(AES_BLOCK_SIZE - 1)]
            ]
        ;
    }
    s_currentAckTransmissionSecurity.ctr.numProcessedEncryptionBlocks++;

    // Upload Last Payload-Chunk to be encrypted befor MIC
    if (s_currentAckTransmission.numBytesUploaded < (s_currentAckTransmissionSecurity.headerLen + s_currentAckTransmissionSecurity.payloadLen))
    {
        //Write via SRAM starting from Addr of the current Byte to the Framebuffer
        samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, (uint8_t)(s_currentAckTransmission.numBytesUploaded + 1));//phyLen not in psduLen

        for (uint8_t i = 0; i < AES_BLOCK_SIZE; i++)
        {

            // Upload remaining to Framebuffer
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
            samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
            if (s_currentAckTransmissionSecurity.needsEncryption)
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_currentAckTransmission.otAck.mPsdu[s_currentAckTransmission.numBytesUploaded++] 
                    ^ s_currentAckTransmissionSecurity.encryptionBlocks[s_currentAckTransmissionSecurity.ctr.numProcessedEncryptionBlocks][i]);
            }
            else
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_currentAckTransmission.otAck.mPsdu[s_currentAckTransmission.numBytesUploaded++]);
            }

            // Break if entire payload is uploaded
            if (s_currentAckTransmission.numBytesUploaded >= (s_currentAckTransmissionSecurity.headerLen + s_currentAckTransmissionSecurity.payloadLen))
            {
                break;
            }
        }
        samr21TrxSpiCloseAccess();
    }
    s_rxBuffer[s_activeRxBuffer].status = RX_STATUS_SENDING_ENH_ACK_UPLOADED_PAYLOAD;
}
//this function gets triggered once by the main handler and after by a Timer.
//this is because there is nothing to do while the AES-Engine is busy
static void samr21RadioRxAckCalcMic(){
    
    //Only executed on first Round
    if(s_rxBuffer[s_activeRxBuffer].status != TX_STATUS_SENDING_BUSY_MIC){

        s_rxBuffer[s_activeRxBuffer].status  = TX_STATUS_SENDING_BUSY_MIC;
        // Form init Vektor (See IEEE 802.15.4-2015 Appendix B for good examples)
        s_currentAckTransmissionSecurity.cbcBlock[0] = 
            (s_currentAckTransmissionSecurity.headerLen != 0 ? 0x01000000 : 0x0) 
            | (((s_currentAckTransmissionSecurity.micSize) >> 1) << 3) | 1; // L always 2
        s_currentAckTransmissionSecurity.cbcBlock[14] = 0; // always 0 cause maxlenght is 127
        s_currentAckTransmissionSecurity.cbcBlock[15] = s_currentAckTransmissionSecurity.headerLen;
        memcpy(&s_currentAckTransmissionSecurity.cbcBlock[1], s_currentAckTransmissionSecurity.nonce, 13);

        // start the first CBC-Round  (plain ECB, r21 datasheet 40.1.4.2 Cipher Block Chaining (CBC))
        // simultaneously retive the MIC encryptionBlock from the CTR-Section ()
        samr21RadioAesEcbEncrypt(s_currentAckTransmissionSecurity.cbcBlock, s_currentAckTransmissionSecurity.pendingAesResultBuffer);
        samr21Timer4Set(21); //AES-Engine takes 21us

        // Only the result of the last CBC Round is of interest
        // The output of the rounds in between can be discarded
        s_currentAckTransmissionSecurity.pendingAesResultBuffer = NULL;

        s_currentAckTransmissionSecurity.cbcBlock[0]^= s_currentAckTransmissionSecurity.headerLen >> 8;
        s_currentAckTransmissionSecurity.cbcBlock[1]^= s_currentAckTransmissionSecurity.headerLen >> 0;

        s_currentAckTransmissionSecurity.cbc.currentBlockLen = 2;
        s_currentAckTransmissionSecurity.cbc.numProcessedHeaderBytes = 0;
        s_currentAckTransmissionSecurity.cbc.numProcessedPayloadBytes = 0;

        goto fillNextBlock;
    }

    //Still Rounds to go
    if (
        s_currentAckTransmissionSecurity.cbc.numProcessedHeaderBytes < s_currentAckTransmissionSecurity.headerLen
        ||s_currentAckTransmissionSecurity.cbc.numProcessedPayloadBytes < s_currentAckTransmissionSecurity.payloadLen
    ){
        samr21RadioAesCbcEncrypt(s_currentAckTransmissionSecurity.cbcBlock, AES_BLOCK_SIZE, NULL);
        samr21Timer4Set(21);//AES takes 21us
        goto fillNextBlock;
    }

    //This is the last CBC Round the result of this is the (unencrypted!) MIC
    if (
        s_currentAckTransmissionSecurity.cbc.numProcessedHeaderBytes == s_currentAckTransmissionSecurity.headerLen
        ||s_currentAckTransmissionSecurity.cbc.numProcessedPayloadBytes == s_currentAckTransmissionSecurity.payloadLen
    ){
        samr21RadioAesCbcEncrypt(s_currentAckTransmissionSecurity.cbcBlock, AES_BLOCK_SIZE, NULL);
        s_currentAckTransmissionSecurity.pendingAesResultBuffer = s_currentAckTransmissionSecurity.cbcBlock; //Put the result back into the cbcBlockBuffer
        samr21Timer4Set(21); //AES takes 21us

