dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioRxHandler.c
        s_rxBuffer[s_activeRxBuffer].status = RX_STATUS_SENDING_ENH_ACK_WAIT_FOR_MIC;
        return;
    }


fillNextBlock:

    //Fill CBC-Input-Block with Header, pad remainder with 0x00.
    if(s_currentAckTransmissionSecurity.cbc.numProcessedHeaderBytes < s_currentAckTransmissionSecurity.headerLen){
        while (s_currentAckTransmissionSecurity.cbc.currentBlockLen < AES_BLOCK_SIZE)
        {
            s_currentAckTransmissionSecurity.cbcBlock[s_currentAckTransmissionSecurity.cbc.currentBlockLen++] =
                (s_currentAckTransmissionSecurity.cbc.numProcessedHeaderBytes < s_currentAckTransmissionSecurity.headerLen ?
                    s_currentAckTransmissionSecurity.header[s_currentAckTransmissionSecurity.cbc.numProcessedHeaderBytes++]
                    : 0x00
                ) 
            ;
        }
        return;
    }
    //Fill CBC-Input-Block with Payload, pad remainder with 0x00.
    if(s_currentAckTransmissionSecurity.cbc.numProcessedPayloadBytes < s_currentAckTransmissionSecurity.payloadLen){
        while (s_currentAckTransmissionSecurity.cbc.currentBlockLen < AES_BLOCK_SIZE)
        {
            s_currentAckTransmissionSecurity.cbcBlock[s_currentAckTransmissionSecurity.cbc.currentBlockLen++] =
                (s_currentAckTransmissionSecurity.cbc.numProcessedPayloadBytes < s_currentAckTransmissionSecurity.payloadLen ?
                    s_currentAckTransmissionSecurity.payload[s_currentAckTransmissionSecurity.cbc.numProcessedPayloadBytes++]
                    : 0x00
                ) 
            ;
        }
        return;
    }
}

static void samr21RadioRxAckUploadMic(){
    
    samr21RadioAesReadBuffer(s_currentAckTransmissionSecurity.cbcBlock, 0, s_currentAckTransmissionSecurity.micSize); //AesResultBuffer == cbcBlock
    
    //Write via SRAM starting from Addr of the current Byte to the Framebuffer (->footer)
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, (uint8_t)(s_currentAckTransmission.numBytesUploaded + 1)); //phyLen not in psduLen 

        for (uint8_t i = 0; i < s_currentAckTransmissionSecurity.micSize; i++)
        {

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
            samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
            if (s_currentAckTransmissionSecurity.needsEncryption)
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_currentAckTransmissionSecurity.cbcBlock[i] ^ s_currentAckTransmissionSecurity.encryptionBlocks[0][i]); //MIC is encrypted with CTR Block i=0
                s_currentAckTransmission.numBytesUploaded++; 
            }
            else
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_currentAckTransmissionSecurity.cbcBlock[i]);
                s_currentAckTransmission.numBytesUploaded++;
            }
        }
        samr21TrxSpiCloseAccess();


        s_rxBuffer[s_activeRxBuffer].status = RX_STATUS_SENDING_ACK_WAIT_TRX_END;
        samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);

    //Queue Move to RX (For ACK) in advance, this will only executes after TX is done
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
}

static void samr21RadioRxSendEnhAck()
{
    while (g_trxStatus.bit.trxStatus != TRX_STATUS_PLL_ON)
    {
        samr21TrxUpdateStatus();
    }

    // Start Trasmission in advance, there is some spare time while the Preamble and SFD is transmitted
    samr21TrxSetSLP_TR(true);
    PORT->Group[0].OUTSET.reg= PORT_PA08;
    
    RxBuffer *buffer = &s_rxBuffer[s_activeRxBuffer];
    buffer->status = RX_STATUS_SENDING_ENH_ACK_UPLOADED_HEADER;
    // Timout-Timer
    samr21Timer4Set((IEEE_802_15_4_FRAME_SIZE * 2) * IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us);


    uint8_t ieData[IEEE_802_15_4_PDSU_SIZE];
    uint8_t ieDataLen = 0;

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    if (g_cslPeriod > 0)
    {
        ieData[ieDataLen++] = CSL_IE_HEADER_BYTES_LO;
        ieData[ieDataLen++] = CSL_IE_HEADER_BYTES_HI;

        uint16_t cslPhase = samr21RadioCtrlCslGetPhase();
        memcpy(&ieData[ieDataLen], &cslPhase, sizeof(uint16_t));
        ieDataLen += sizeof(uint16_t);

        memcpy(&ieData[ieDataLen], &g_cslPeriod, sizeof(uint16_t));
        ieDataLen += sizeof(uint16_t);
    }
#endif

#ifdef OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
    otMacAddress macAddress;
    otMacFrameGetSrcAddr(&(buffer->otFrame), &macAddress);
    uint8_t linkMetricsDataLen = otLinkMetricsEnhAckGenData(
        &macAddress, 
        buffer->otFrame.mInfo.mRxInfo.mLqi,
        buffer->otFrame.mInfo.mRxInfo.mRssi
        &ieData[ieDataLen+4] //IE VENDOR HEADER LENGTH
    );

    if (linkMetricsDataLen)
    {    
        ieData[ieDataLen++] =  ENH_ACK_PROBING_IE; 
        
        ieData[ieDataLen++] =  ( VENDOR_OUI_THREAD_COMPANY_ID & 0x0000FF ) >> 0; 
        ieData[ieDataLen++] =  ( VENDOR_OUI_THREAD_COMPANY_ID & 0x00FF00 ) >> 8; 
        ieData[ieDataLen++] =  ( VENDOR_OUI_THREAD_COMPANY_ID & 0xFF0000 ) >> 16; 

        ieDataLen += linkMetricsDataLen;
    }
#endif

    otMacFrameGenerateEnhAck(
        &(buffer->otFrame),
        buffer->framePending,
        ieData,
        ieDataLen,
        &s_currentAckTransmission.otAck);

    buffer->otFrame.mInfo.mRxInfo.mAckedWithFramePending = buffer->framePending;
    s_currentAckTransmission.otAck.mPsdu[-1] = s_currentAckTransmission.otAck.mLength;

    s_currentAckTransmissionSecurity.securityHeaderPresent = 0;

    if(otMacFrameIsSecurityEnabled(&s_currentAckTransmission.otAck)){
        __disable_irq();

        buffer->otFrame.mInfo.mRxInfo.mAckFrameCounter = g_macFrameCounter;
        otMacFrameSetFrameCounter(&s_currentAckTransmission.otAck, g_macFrameCounter++);
        
        if(otMacFrameIsKeyIdMode1(&s_currentAckTransmission.otAck)){
            otMacFrameSetKeyId(&s_currentAckTransmission.otAck, g_currKeyId);
            buffer->otFrame.mInfo.mRxInfo.mAckKeyId = g_currKeyId;
            s_currentAckTransmission.otAck.mInfo.mTxInfo.mAesKey = (const otMacKeyMaterial *)&g_currKey;
        }

        s_currentAckTransmissionSecurity.securityHeaderPresent = 1;
        __enable_irq();
    } else {
        //If there is no Security processing needed, the frame can just be uploaded
        samr21RadioRxAckUploadAllRaw();
        return;
    }

