dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioRxHandler.c
    //Get some Markers for AES 
    s_currentAckTransmissionSecurity.header = otMacFrameGetHeader(&s_currentAckTransmission.otAck);
    s_currentAckTransmissionSecurity.payload = otMacFrameGetPayload(&s_currentAckTransmission.otAck);
    s_currentAckTransmissionSecurity.mic = otMacFrameGetFooter(&s_currentAckTransmission.otAck);

    s_currentAckTransmissionSecurity.headerLen =  s_currentAckTransmissionSecurity.payload - s_currentAckTransmission.psdu; //calc offset between pointers
    s_currentAckTransmissionSecurity.payloadLen = s_currentAckTransmissionSecurity.mic - s_currentAckTransmissionSecurity.payload;


    // Upload only the unencrypted Header Part first
    // This gives some Headroom to perform AES-CCM*
    samr21RadioRxAckUploadHeader();

    uint8_t securityLevel = otMacFrameGetSecurityLevel(&s_currentAckTransmission.otAck);

    s_currentAckTransmissionSecurity.needsEncryption = (securityLevel & 0b100 ? 1 : 0);

    switch (securityLevel & 0b11)
    {
    case 0b00:
        s_currentAckTransmissionSecurity.micSize = 0;
        break;
    
    case 0b01:
        s_currentAckTransmissionSecurity.micSize = 4;
        break;
    
    case 0b10:
        s_currentAckTransmissionSecurity.micSize = 8;
        break;
    
    case 0b11:
        s_currentAckTransmissionSecurity.micSize = 16;
        break;
    }

    //Generate Nonce and first EncryptionBlock if needed (TRX is busy with sending Preamble and SFD anyways)
    if (securityLevel)
    {
        otMacGenerateNonce(&s_currentAckTransmission.otAck, (uint8_t *)(&g_extAddr), s_currentAckTransmissionSecurity.nonce);
        samr21RadioAesKeySetup((uint8_t *)s_currentAckTransmission.otAck.mInfo.mTxInfo.mAesKey);

        if(s_currentAckTransmissionSecurity.needsEncryption){

            s_currentAckTransmissionSecurity.nonce[(AES_BLOCK_SIZE - 2)] = 0; // Always 0 cause max nonce-ctr == 8 (FRAME_SIZE / BLOCKSIZE)
            s_currentAckTransmissionSecurity.nonce[(AES_BLOCK_SIZE - 1)] = 1; // The first Nonce for Payload encryption has CTR value 1

            // Start generating the encrytion mask for the first block
            // The AES-Engine of the at86rf233 takes 21us per Block
            samr21RadioAesEcbEncrypt(s_currentAckTransmissionSecurity.nonce, NULL);

            s_currentAckTransmissionSecurity.ctr.numProcessedEncryptionBlocks = 0;
            s_currentAckTransmissionSecurity.pendingAesResultBuffer = 
                s_currentAckTransmissionSecurity.encryptionBlocks[
                    s_currentAckTransmissionSecurity.nonce[(AES_BLOCK_SIZE - 1)]
                ]
            ;
        }
    }
    
    // Upload the Payload next. This takes time ~100us per 16Byte Block ( ~40us without Encryption ) 
    // The Trx ist still busy transmitting the so far uploaded Framebuffer
    samr21RadioRxAckUploadPayload();


    if(s_currentAckTransmissionSecurity.micSize)
    {
        // Start the Calculation of the MIC. This take Time (~60us * ( 2 + psduLen/16 ) )
        // While the AES-Engine is Busy there is not a lot to do.
        // Because of that, this Secetion is relauched Multiple Times by a Timer-IRQ
        // We just start the first Round here and wait for the said Timer-IRQ (See TxEventHandler)
        // If Encryption is enabled, the AES-Buffer should hold the result for the CTR=0 Encrytion Block (needed for MIC encryption)
        samr21RadioRxAckCalcMic();
        return;
    }

    //FCS is appended by at86rf233

    //Queue Move to RX (For ACK) in advance, this will only executes after TX is done
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);

    buffer->status = RX_STATUS_SENDING_ACK_WAIT_TRX_END;
    samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);
}

static void samr21RadioRxDownloadRemaining()
{
    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_READ, 0);

    RxBuffer *buffer = &s_rxBuffer[s_activeRxBuffer];

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    buffer->otFrame.mLength = samr21TrxSpiReadByteRaw();
    uint8_t numDownloadedPdsuBytes = 0;

    if (buffer->otFrame.mLength > IEEE_802_15_4_PDSU_SIZE)
    {
        samr21TrxSpiCloseAccess();
        samr21RadioRxCleanup(false);
        return;
    }

    // Dowload FCF+ADDR Field First
    while (numDownloadedPdsuBytes < buffer->otFrame.mLength)
    {
        uint32_t timeout = 0xFFFF;
        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        samr21delaySysTick(CPU_WAIT_CYCLES_FOR_FRAME_BUFFER_EMPTY_FLAG);
        while ((PORT->Group[1].IN.reg & PORT_PB00) && timeout && !s_rxAbort)
        {
            timeout--;
        }

        if (timeout && !s_rxAbort)
        {
            buffer->otFrame.mPsdu[numDownloadedPdsuBytes++] =
                samr21TrxSpiReadByteRaw();
            ;
        }
        else
        {
            samr21TrxSpiCloseAccess();
            samr21RadioRxCleanup(false);
            return;
        }
    }
    // Dowload LQI, RSSI and CRC Check (r21 Datasheet 35.3.2 -  Frame Buffer Access Mode)
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    buffer->otFrame.mInfo.mRxInfo.mLqi = samr21TrxSpiReadByteRaw();

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    buffer->otFrame.mInfo.mRxInfo.mRssi = AT86RF233_RSSI_BASE_VAL + samr21TrxSpiReadByteRaw();

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    AT86RF233_REG_RX_STATUS_t rxStatus = (AT86RF233_REG_RX_STATUS_t)samr21TrxSpiReadByteRaw();

    samr21TrxSpiCloseAccess();


    if (!rxStatus.bit.crcValid)
    {
        samr21RadioRxCleanup(false);
        return;
    }

    if(g_promiscuousMode){
        samr21RadioRxCleanup(true);
        return;
    }

    if (otMacFrameIsAckRequested(&(buffer->otFrame)))
    {

        // Prep TRX
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_FORCE_PLL_ON);

        if (otMacFrameIsVersion2015(&(buffer->otFrame)))
        {
            samr21RadioRxSendEnhAck();
            return;
        }

        samr21RadioRxSendImmAck();
    }

    samr21RadioRxCleanup(true);
}

static void samr21RadioRxDownloadAddrField()
{
    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_READ, 0);

    RxBuffer *buffer = &s_rxBuffer[s_activeRxBuffer];

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    buffer->otFrame.mLength = samr21TrxSpiReadByteRaw();
    uint8_t numDownloadedPdsuBytes = 0;

    if (buffer->otFrame.mLength > IEEE_802_15_4_PDSU_SIZE)
    {
        samr21TrxSpiCloseAccess();
        samr21RadioRxCleanup(false);
        return;
    }

    // Dowload FCF+ADDR Field First
    while (numDownloadedPdsuBytes < buffer->neededPdsuSizeForNextAction)
    {
        uint32_t timeout = 0xFFFF;
        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        samr21delaySysTick(CPU_WAIT_CYCLES_FOR_FRAME_BUFFER_EMPTY_FLAG);
        while ((PORT->Group[1].IN.reg & PORT_PB00) && timeout && !s_rxAbort)
        {
            timeout--;
        }

