dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioRxHandler.c
        if (timeout && !s_rxAbort)
        {
            buffer->otFrame.mPsdu[numDownloadedPdsuBytes++] =
                samr21TrxSpiReadByteRaw();
            ;
        }
        else
        {
            samr21TrxSpiCloseAccess();
            samr21RadioRxCleanup(false);
            return;
        }
    }
    samr21TrxSpiCloseAccess();

    if (!g_promiscuousMode && !otMacFrameDoesAddrMatch(
            &(buffer->otFrame),
            g_panId,
            g_shortAddr,
            (const otExtAddress *)(&g_extAddr)))
    {
        samr21RadioRxCleanup(false);
        return;
    }

    uint32_t nextAction_us =
        ((buffer->otFrame.mLength - numDownloadedPdsuBytes) * IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us) - (AT86RF233_SPI_INIT_TIME_FRAMEBUFFER_us + RX_FRAMEBUFFER_ACCESS_HEADROOM_us) - ((buffer->otFrame.mLength + AT86RF233_FRAMEBUFFER_MISC_SIZE) * AT86RF233_SPI_TIME_PER_BYTE_us);

    buffer->neededPdsuSizeForNextAction = buffer->otFrame.mLength;
    buffer->status = RX_STATUS_RECIVING_REMAINING;

    if (nextAction_us > 0xFFFF || nextAction_us < RX_FRAMEBUFFER_ACCESS_HEADROOM_us)
    {
        samr21RadioRxDownloadRemaining();
        return;
    }

    samr21Timer4Set(nextAction_us);
}




static void samr21RadioRxStart(uint8_t channel)
{

    // Set Timer for listening duration
    if (s_slottedListeningDuration_us)
    {
        s_rxSlottedActive = true;
        samr21RtcSetAlarm(samr21RtcGetTimestamp() + s_slottedListeningDuration_us);
    }


    // Check if theres already an ongoing Reception
    if (s_rxHandlerActive)
    {
        if (channel == g_phyCcCcaReg.bit.channel)
        {
            return; // TRX is allrdy setup for reception on the desired channel
        }
        samr21RadioRxCleanup(false);
    }

    g_irqMask = (AT86RF233_REG_IRQ_MASK_t){
        .bit.pllLock = 0,
        .bit.pllUnlock = 0,
        .bit.rxStart = 1,
        .bit.trxEnd = 1,
        .bit.ccaEdDone = 0,
        .bit.addressMatch = 0,
        .bit.bufferUnderRun = 1,
        .bit.batteryLow = 0};
    samr21TrxWriteRegister(IRQ_MASK_REG, g_irqMask.reg);

    // Set Channel of TRX
    g_phyCcCcaReg.bit.channel = channel;
    samr21TrxWriteRegister(PHY_CC_CCA_REG, g_phyCcCcaReg.reg);

    // Prepare RX-Buffer
    if (s_rxBuffer[s_activeRxBuffer].status != RX_STATUS_IDLE)
    {
        s_activeRxBuffer = ( s_activeRxBuffer + 1 ) % NUM_SAMR21_RX_BUFFER;
        samr21RadioRxResetBuffer(&s_rxBuffer[s_activeRxBuffer]);
    }

    // Check and enforce that the Transciver is in recive state
    if (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON)
    {
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        while (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON)
        {
            samr21TrxUpdateStatus();
        }
    }

}

static void samr21RadioRxReceptionStarted()
{
    PORT->Group[0].OUTSET.reg= PORT_PA09;
    s_rxBuffer[s_activeRxBuffer].status = RX_STATUS_RECIVING_FCF;
    s_rxBuffer[s_activeRxBuffer].otFrame.mInfo.mRxInfo.mTimestamp =
        samr21RtcGetTimestamp();
    s_rxBuffer[s_activeRxBuffer].otFrame.mChannel = g_phyCcCcaReg.bit.channel;
    samr21Timer4Set(RX_BACKOFF_BEFORE_FIRST_FRAMEBUFFER_ACCESS);
}

static void samr21RadioRxDownloadFCF()
{
    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_READ, 0);

    RxBuffer *buffer = &s_rxBuffer[s_activeRxBuffer];

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    buffer->otFrame.mLength = samr21TrxSpiReadByteRaw();
    uint8_t numDownloadedPdsuBytes = 0;

    if (buffer->otFrame.mLength > IEEE_802_15_4_PDSU_SIZE)
    {
        samr21TrxSpiCloseAccess();
        samr21RadioRxCleanup(false);
        return;
    }

    // Dowload FCS + DSN Field First
    while (numDownloadedPdsuBytes < IEEE_802_15_4_STATIC_HEADER_SIZE)
    {
        uint32_t timeout = 0xFFFF;
        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        samr21delaySysTick(CPU_WAIT_CYCLES_FOR_FRAME_BUFFER_EMPTY_FLAG);
        while ((PORT->Group[1].IN.reg & PORT_PB00) && timeout && !s_rxAbort)
        {
            timeout--;
        }

        if (timeout && !s_rxAbort)
        {
            buffer->otFrame.mPsdu[numDownloadedPdsuBytes++] =
                samr21TrxSpiReadByteRaw();
            ;
        }
        else
        {
            samr21TrxSpiCloseAccess();
            samr21RadioRxCleanup(false);
            return;
        }
    }
    samr21TrxSpiCloseAccess();

    uint8_t relevantOctets = 0;

    otMacAddress srcAddr;
    otMacAddress dstAddr;

    otMacFrameGetSrcAddr(&(buffer->otFrame), &srcAddr);
    otMacFrameGetDstAddr(&(buffer->otFrame), &dstAddr);

    if (dstAddr.mType != OT_MAC_ADDRESS_TYPE_NONE)
    {
        relevantOctets +=
            (dstAddr.mType == OT_MAC_ADDRESS_TYPE_EXTENDED ? sizeof(uint64_t)
                                                           : sizeof(uint16_t));
    }

    if (srcAddr.mType == OT_MAC_ADDRESS_TYPE_EXTENDED)
    {
        relevantOctets += sizeof(uint64_t);
        if (utilsSoftSrcMatchExtFindEntry(srcAddr.mAddress.mExtAddress.m8) >= 0)
        {
            buffer->framePending = true;
        }
        else
        {
            buffer->framePending = false;
        }
    }

    if (srcAddr.mType == OT_MAC_ADDRESS_TYPE_SHORT)
    {
        relevantOctets += sizeof(uint16_t);
        if (utilsSoftSrcMatchShortFindEntry(srcAddr.mAddress.mShortAddress) >= 0)
        {
            buffer->framePending = true;
        }
        else
        {
            buffer->framePending = false;
        }
    }

    relevantOctets += 
        (otMacFrameIsSrcPanIdPresent(&(buffer->otFrame)) ? sizeof(uint16_t) : 0) 
    ;

    relevantOctets += 
        (otMacFrameIsDstPanIdPresent(&(buffer->otFrame)) ? sizeof(uint16_t) : 0)
    ;

    if (relevantOctets)
    {

        uint32_t nextAction_us =
            (relevantOctets * IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us) - (AT86RF233_SPI_INIT_TIME_FRAMEBUFFER_us + RX_FRAMEBUFFER_ACCESS_HEADROOM_us) - ((relevantOctets + IEEE_802_15_4_STATIC_HEADER_SIZE) * AT86RF233_SPI_TIME_PER_BYTE_us);

