dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioRxHandler.c
        buffer->neededPdsuSizeForNextAction = relevantOctets + IEEE_802_15_4_STATIC_HEADER_SIZE;
        buffer->status = RX_STATUS_RECIVING_ADDR_FIELD;

        if (nextAction_us > 0xFFFF || nextAction_us < RX_FRAMEBUFFER_ACCESS_HEADROOM_us)
        {
            samr21RadioRxDownloadAddrField();
            return;
        }

        samr21Timer4Set(nextAction_us);
        return;
    }

    uint32_t nextAction_us =
        ((buffer->otFrame.mLength - numDownloadedPdsuBytes) * IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us) - (AT86RF233_SPI_INIT_TIME_FRAMEBUFFER_us + RX_FRAMEBUFFER_ACCESS_HEADROOM_us) - ((buffer->otFrame.mLength + AT86RF233_FRAMEBUFFER_MISC_SIZE) * AT86RF233_SPI_TIME_PER_BYTE_us);

    buffer->neededPdsuSizeForNextAction = buffer->otFrame.mLength;
    buffer->status = RX_STATUS_RECIVING_REMAINING;

    if (nextAction_us > 0xFFFF || nextAction_us < RX_FRAMEBUFFER_ACCESS_HEADROOM_us)
    {
        samr21RadioRxDownloadRemaining();
        return;
    }

    samr21Timer4Set(nextAction_us);
}


bool samr21RadioRxBusy()
{
    return (s_rxBuffer[s_activeRxBuffer].status == RX_STATUS_IDLE ? false : true);
}



bool samr21RadioRxIsReceiveSlotPlanned(){
    return s_slottedListeningDuration_us;
}


void samr21RadioRxResetAllBuffer()
{
    s_currentAckTransmission.otAck.mPsdu = &s_currentAckTransmission.psdu[1];

    for (uint16_t i = 0; i < NUM_SAMR21_RX_BUFFER; i++)
    {
        samr21RadioRxResetBuffer(&s_rxBuffer[i]);
    }

    s_activeRxBuffer = 0;
}

void samr21RadioRxResetBuffer(RxBuffer * buffer)
{
    __disable_irq();
    memset(buffer,0x00,sizeof(RxBuffer));
    buffer->status = RX_STATUS_IDLE;
    buffer->otFrame.mPsdu = &buffer->rxFramePsdu[1];
    __enable_irq();
}

void samr21RadioRxPrepareBuffer()
{
    s_activeRxBuffer = ( s_activeRxBuffer + 1 ) % NUM_SAMR21_RX_BUFFER;
    samr21RadioRxResetBuffer(&s_rxBuffer[s_activeRxBuffer]);
}

RxBuffer *samr21RadioRxGetPendingRxBuffer()
{
    for (uint16_t i = 0; i < NUM_SAMR21_RX_BUFFER; i++)
    {
        if (s_rxBuffer[i].status >= RX_STATUS_DONE)
        {
            return &s_rxBuffer[i];
        }
    }
    return NULL;
}

void samr21RadioRxSetup(uint8_t channel, uint32_t duration, uint32_t startTime)
{
    // Wait for current Transmisson (prevent retrys)
    if(samr21RadioTxBusy()){
        samr21RadioTxAbortRetrys();
        while(samr21RadioTxBusy());
    }
    

    samr21RadioSetEventHandler(&samr21RadioRxEventHandler);
    s_rxHandlerActive = true;
    s_rxAbort = false;

    if (duration || startTime)
    {
        s_slottedListeningChannel = channel;
        s_slottedListeningDuration_us = duration;

        if(startTime - samr21RtcGetTimestamp() > 0x000FFFFF) //overflow, cause time is negative
        {
            samr21RadioRxStart(channel);
            return;            
        }

        samr21RtcSetAlarm(startTime);
        return;
    }

    samr21RadioRxStart(channel);
    return;
}


void samr21RadioRxEventHandler(IrqEvent event)
{
    if(s_rxAbort){
        samr21RadioRxCleanup(false);
        return;
    }
    
    RxBuffer *buffer = &s_rxBuffer[s_activeRxBuffer];

    switch (event)
    {
    case TIMER_EVENT_4_TRIGGER:

        if (buffer->status == RX_STATUS_RECIVING_FCF)
        {
            samr21RadioRxDownloadFCF();
            return;
        }

        if (buffer->status == RX_STATUS_RECIVING_ADDR_FIELD)
        {
            samr21RadioRxDownloadAddrField();
            return;
        }

        if (buffer->status == RX_STATUS_RECIVING_REMAINING)
        {
            samr21RadioRxDownloadRemaining();
            return;
        }

        if (buffer->status == RX_STATUS_SENDING_ENH_ACK_BUSY_MIC)
        {
            samr21RadioRxAckCalcMic();
            return;
        }

        if (buffer->status == RX_STATUS_SENDING_ENH_ACK_WAIT_FOR_MIC)
        {
            samr21RadioRxAckUploadMic();
            return;
        }

        // Timeout Something went wrong
        samr21RadioRxCleanup(false);
        return;

    case TRX_EVENT_RX_START:
        if (buffer->status == RX_STATUS_IDLE)
        {
            samr21RadioRxReceptionStarted();
        }
        return;

    case TRX_EVENT_TRX_END:

        PORT->Group[0].OUTCLR.reg= PORT_PA09;
        if (buffer->status == RX_STATUS_SENDING_ACK_WAIT_TRX_END)
        {
            samr21RadioRxCleanup(true);
        }
        return;

    case RTC_EVENT_ALARM_TRIGGER:
        if (!s_rxSlottedActive)
        {
            samr21RadioRxStart(s_slottedListeningChannel);
            return;
        }

        //Wait for current Reception to finish
        while (
            s_rxBuffer[s_activeRxBuffer].status != RX_STATUS_IDLE && s_rxBuffer[s_activeRxBuffer].status != RX_STATUS_DONE)
        ;
        
        s_rxSlottedActive = false;
        s_slottedListeningChannel = 0;
        s_slottedListeningDuration_us = 0;
    
        
        s_rxHandlerActive = ( samr21RadioCtrlReturnToLastHandler() == SAMR21_RADIO_STATE_RECEIVE ? true : false );

        if (!s_recivedFramesWhileSlotActive)
        {
            cb_samr21RadioRxRecivedNothing();
        }

        s_recivedFramesWhileSlotActive = 0;
    default:
        return;
    }
}